{
  "architectures": [
    "TSPulseForReconstruction"
  ],
  "batch_aware_masking": false,
  "categorical_vocab_size_list": null,
  "channel_consistent_masking": true,
  "channel_mix_init": "identity",
  "channel_register_tokens": null,
  "channel_virtual_expand_scale": 1,
  "classification_mode": "full_embedding",
  "context_length": 512,
  "d_model": 16,
  "d_model_layerwise": [
    16,
    16,
    16
  ],
  "d_model_layerwise_scale": [
    1,
    1,
    1
  ],
  "data_actual_context_length": null,
  "decoder_d_model": 16,
  "decoder_d_model_layerwise": [
    16,
    16,
    16
  ],
  "decoder_d_model_layerwise_scale": [
    1,
    1,
    1
  ],
  "decoder_mode": "common_channel",
  "decoder_num_channels_layerwise": [
    1,
    1,
    1
  ],
  "decoder_num_channels_layerwise_scale": [
    1,
    1,
    1
  ],
  "decoder_num_layers": 3,
  "decoder_num_patches_layerwise": [
    64,
    64,
    64
  ],
  "decoder_num_patches_layerwise_scale": [
    1,
    1,
    1
  ],
  "disable_mask_in_classification_eval": true,
  "dropout": 0.2,
  "dtype": "float32",
  "enable_fft_prob_loss": true,
  "expansion_factor": 2,
  "fft_applied_on": "scaled_ts",
  "fft_mask_ratio": null,
  "fft_mask_strategy": "magnitude",
  "fft_original_signal_loss_weight": 1,
  "fft_prob_length": null,
  "fft_prob_mode": "plain",
  "fft_prob_weight": 1,
  "fft_remove_component": "last",
  "fft_time_add_forecasting_pt_loss": false,
  "fft_time_add_forecasting_pt_loss_weight": 1,
  "fft_time_consistent_masking": true,
  "fft_weight": 1,
  "free_channel_flow": true,
  "full_patch_mask_percentage": 0.2,
  "fuse_fft": false,
  "gated_attention_activation": "softmax",
  "gated_attn": true,
  "head_aggregation": null,
  "head_aggregation_dim": "patch",
  "head_attention": false,
  "head_dropout": 0.2,
  "head_gated_attention_activation": "softmax",
  "head_reduce_channels": null,
  "head_reduce_d_model": null,
  "hydra_class_attention": true,
  "hydra_class_head": null,
  "init_embed": "pytorch",
  "init_linear": "pytorch",
  "init_processing": true,
  "init_std": 0.02,
  "loss": "mse",
  "loss_apply_mode": "mask",
  "mask_block_length": 8,
  "mask_ratio": null,
  "mask_type": "block",
  "masked_reconstruction_loss_weight": 1,
  "min_allowed_range": 4,
  "minimum_scale": 1e-05,
  "mode": "common_channel",
  "model_type": "tspulse",
  "norm_eps": 1e-05,
  "norm_mlp": "LayerNorm",
  "num_channels_layerwise": [
    1,
    1,
    1
  ],
  "num_channels_layerwise_scale": [
    1,
    1,
    1
  ],
  "num_full_patches_for_hybrid_mask": 2,
  "num_input_channels": 1,
  "num_layers": 3,
  "num_patches": 64,
  "num_patches_layerwise": [
    64,
    64,
    64
  ],
  "num_patches_layerwise_scale": [
    1,
    1,
    1
  ],
  "num_targets": 3,
  "output_range": null,
  "patch_last": true,
  "patch_length": 8,
  "patch_register_tokens": 8,
  "patch_stride": 8,
  "positional_encoding_type": "sincos",
  "post_init": false,
  "prediction_length": 96,
  "reconstruction_loss_weight": 1,
  "reconstruction_type": "patchwise",
  "register_mixer_layers": null,
  "revin_affine": true,
  "scaling": "revin",
  "self_attn": false,
  "self_attn_heads": 1,
  "transformers_version": "4.56.0",
  "use_learnable_mask_token": true,
  "use_positional_encoding": false
}
